Revit 2026 API

# ParameterGUID Property

---

The Guid for a shared parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Guid GUID { get; }
```
```vb
Public ReadOnly Property GUID As Guid
	Get
```
```cpp
public:
property Guid GUID {
	Guid get ();
}
```
```fsharp
member GUID : Guid with get
```

#### Property Value

Guid

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the parameter is not a shared parameter. |

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace